# Assignment 1 : Python Data Analysis using salaries dataset

# Data Exploration:  This should include summary statistics, means, medians, quartiles, or any other relevant information about the data set.

In [36]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/niteen11/data301_predictive_analytics_machine_learning/main/data/Salaries.csv')

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
# 397 rows = 397 employees
df.shape

(397, 7)

In [6]:
df.head()

   Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
0           1      Prof          B             19           18  Male  139750
1           2      Prof          B             20           16  Male  173200
2           3  AsstProf          B              4            3  Male   79750
3           4      Prof          B             45           39  Male  115000
4           5      Prof          B             40           41  Male  141500

In [7]:
df.tail()

     Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
392         393      Prof          A             33           30  Male  103106
393         394      Prof          A             31           19  Male  150564
394         395      Prof          A             42           25  Male  101738
395         396      Prof          A             25           15  Male   95329
396         397  AsstProf          A              8            4  Male   81035

In [8]:
df.describe()

       Unnamed: 0  yrs.since.phd  yrs.service         salary
count  397.000000     397.000000   397.000000     397.000000
mean   199.000000      22.314861    17.614610  113706.458438
std    114.748275      12.887003    13.006024   30289.038695
min      1.000000       1.000000     0.000000   57800.000000
25%    100.000000      12.000000     7.000000   91000.000000
50%    199.000000      21.000000    16.000000  107300.000000
75%    298.000000      32.000000    27.000000  134185.000000
max    397.000000      56.000000    60.000000  231545.000000

# Mean/median of all salaries

In [9]:
# Mean of all salaries
df.mean()

Unnamed: 0          199.000000
yrs.since.phd        22.314861
yrs.service          17.614610
salary           113706.458438
dtype: float64

In [10]:
# Median of all salaries
df.median()

Unnamed: 0          199.0
yrs.since.phd        21.0
yrs.service          16.0
salary           107300.0
dtype: float64

# Median salary between gender and/or rank(title) Etc...

Making a new Data Frame that only has the columns 'sex' and 'salary'

In [11]:
ss = df[['sex', 'salary']]

In [12]:
ss

      sex  salary
0    Male  139750
1    Male  173200
2    Male   79750
3    Male  115000
4    Male  141500
..    ...     ...
392  Male  103106
393  Male  150564
394  Male  101738
395  Male   95329
396  Male   81035

[397 rows x 2 columns]

Finding the Median salary for all males

In [13]:
ss['salary'] = df['salary'].astype(int); inplace = True

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [14]:
m = [ss['sex'] == 'male']

In [19]:
p = df[df['sex'] == 'male']['salary']

In [24]:
p.median

Finding the Median salary for all females

In [ ]:
fem = df[df['sex']== 'female']

In [ ]:
fem.median

Comparing the Mean salary of Males and Females

In [ ]:
# The difference between mean salaries of male and female

# Data Wrangling – perform some basic transformations on the data

People who have 20 years of experience (Total: 157), (Mean Salary: 122,520.66)

In [31]:
df[df['yrs.service'] == 20]['salary']

8      119250
16     101000
82     144640
94     123683
173    134185
209    163200
223    129600
225    122400
353    138000
371    110515
Name: salary, dtype: int64

Comparing the salaries of people who have 20+ years of experience vs less than 20 years of experience

In [26]:
df[df['yrs.service'] > 20]['salary']

3      115000
4      141500
6      175000
7      147765
17     103450
        ...
384    125192
386    139219
388    119450
392    103106
394    101738
Name: salary, Length: 147, dtype: int64

In [27]:
df[df['yrs.service'] < 20]['salary']

0      139750
1      173200
2       79750
5       97000
9      129000
        ...
390    166605
391    151292
393    150564
395     95329
396     81035
Name: salary, Length: 240, dtype: int64

People who have salary of greater than or equal to 200,000

In [28]:
aa = df[df['salary'] >= 200000]

In [29]:
aa.count

<bound method DataFrame.count of      Unnamed: 0  rank discipline  yrs.since.phd  yrs.service   sex  salary
43           44  Prof          B             38           38  Male  231545
249         250  Prof          A             29            7  Male  204000
364         365  Prof          A             43           43  Male  205500>

Your Findings here...

# Rename values, subset columns, etc

In [34]:
df2 = df.rename(columns= {'yrs.service': 'exp'})

In [35]:
df2

     Unnamed: 0      rank discipline  yrs.since.phd  exp   sex  salary
0             1      Prof          B             19   18  Male  139750
1             2      Prof          B             20   16  Male  173200
2             3  AsstProf          B              4    3  Male   79750
3             4      Prof          B             45   39  Male  115000
4             5      Prof          B             40   41  Male  141500
..          ...       ...        ...            ...  ...   ...     ...
392         393      Prof          A             33   30  Male  103106
393         394      Prof          A             31   19  Male  150564
394         395      Prof          A             42   25  Male  101738
395         396      Prof          A             25   15  Male   95329
396         397  AsstProf          A              8    4  Male   81035

[397 rows x 7 columns]

# Create some simple visualizations showing some simple statistics

Your observations from the visuals:

# Draw some conclusions based on the data.  What did you discover?

Based on the analysis performed above, the conclusions are as follows:

Your Findings here...



I also discovered that the -

 Your Findings here...